#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_security_group.awsplay_lb_security_group: Refreshing state... [id=sg-01e20e22f4d821a29]
aws_default_subnet.default_subnet_a: Refreshing state... [id=subnet-9c348bf7]
data.aws_iam_policy_document.assume_role_policy: Reading...
aws_ecs_cluster.awsplay: Refreshing state... [id=arn:aws:ecs:eu-west-1:286972415665:cluster/awsplay]
aws_dynamodb_table.awsplay: Refreshing state... [id=awsplay]
aws_default_subnet.default_subnet_c: Refreshing state... [id=subnet-9d348bf6]
aws_default_subnet.default_subnet_b: Refreshing state... [id=subnet-9e348bf5]
aws_default_vpc.default_vpc: Refreshing state... [id=vpc-9f348bf4]
data.aws_iam_policy_document.assume_role_policy: Read complete after 0s [id=320642683]
aws_iam_role.awsplay_task_role: Refreshing state... [id=awsplay-task-role]
aws_iam_role.awsplay_task_execution_role: Refreshing state... [id=awsplay-task-execution-role]
aws_security_group.awsplay_fargate_security_group: Refreshing state... [id=sg-0434eb771b67e0d0b]
aws_alb.awsplay_lb: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:286972415665:loadbalancer/app/awsplay-lb/036747a34a38a565]
aws_iam_role_policy_attachment.awsplay_task_role_policy: Refreshing state... [id=awsplay-task-role-20230301231452449000000001]
aws_iam_role_policy_attachment.awsplay_task_execution_role_policy: Refreshing state... [id=awsplay-task-execution-role-20230301231452450600000002]
aws_ecs_task_definition.awsplay: Refreshing state... [id=awsplay]
aws_route53_record.awsplay: Refreshing state... [id=Z2Z0QPGK7E01E9_awsplay.diman8.net_A]
aws_lb_target_group.fargate: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:286972415665:targetgroup/fargate/49f2e519da1336dd]
aws_lb_listener.listener: Refreshing state... [id=arn:aws:elasticloadbalancing:eu-west-1:286972415665:listener/app/awsplay-lb/036747a34a38a565/63972df79a75c554]
aws_ecs_service.awsplay_service: Refreshing state... [id=arn:aws:ecs:eu-west-1:286972415665:service/awsplay/awsplay-service]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.awsplay_service will be updated in-place
  ~ resource "aws_ecs_service" "awsplay_service" {
        id                                 = "arn:aws:ecs:eu-west-1:286972415665:service/awsplay/awsplay-service"
        name                               = "awsplay-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-west-1:286972415665:task-definition/awsplay:18" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.awsplay must be replaced
-/+ resource "aws_ecs_task_definition" "awsplay" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:286972415665:task-definition/awsplay:18" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - environment      = [] -> null
                  ~ image            = "286972415665.dkr.ecr.eu-west-2.amazonaws.com/awsplay:99992399994868bfe89a831ba62c90e507fb5e02" -> "286972415665.dkr.ecr.eu-west-2.amazonaws.com/awsplay:db8e2044bd85d2fea56e15e3209cb39df4637f53"
                  - mountPoints      = [] -> null
                    name             = "awsplay"
                  ~ portMappings     = [
                      ~ {
                          - protocol      = "tcp" -> null
                            # (2 unchanged elements hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (4 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "awsplay" -> (known after apply)
      ~ revision                 = 18 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @vyrostkov, Action: `pull_request`*